In [1]:
import pandas as pd

In [2]:
alunosDIC = {'Nome' :['Victor', 'Luan', 'Guga','Rever'],
            'Nota': [4, 7, 5.5, 9],
             'Aprovado': ['Não','Sim', 'Não', 'Sim']
            }

## Criando um DataFrame com um Dict

In [7]:
alunosDf = pd.DataFrame(alunosDIC)
alunosDf.head()

     Nome  Nota Aprovado
0  Victor   4.0      Não
1    Luan   7.0      Sim
2    Guga   5.5      Não
3   Rever   9.0      Sim

## Tamanho do Dataframe

In [8]:
alunosDf.shape

(4, 3)

## Describe - Informações numéricos

In [9]:
alunosDf.describe()

           Nota
count  4.000000
mean   6.375000
std    2.136001
min    4.000000
25%    5.125000
50%    6.250000
75%    7.500000
max    9.000000

## Pegar Colunas - Slice

In [10]:
alunosDf['Nome']

0    Victor
1      Luan
2      Guga
3     Rever
Name: Nome, dtype: object

## Filtrar Linhas

In [11]:
alunosDf.loc[[0]]

     Nome  Nota Aprovado
0  Victor   4.0      Não

In [14]:
alunosDf.loc[[0,1,2]]

     Nome  Nota Aprovado
0  Victor   4.0      Não
1    Luan   7.0      Sim
2    Guga   5.5      Não

In [13]:
alunosDf.loc[0:2]

     Nome  Nota Aprovado
0  Victor   4.0      Não
1    Luan   7.0      Sim
2    Guga   5.5      Não

In [15]:
alunosDf.loc[alunosDf['Nome']=='Luan']

   Nome  Nota Aprovado
1  Luan   7.0      Sim

In [16]:
alunosDf.loc[alunosDf['Aprovado']=='Sim']

    Nome  Nota Aprovado
1   Luan   7.0      Sim
3  Rever   9.0      Sim

## Criar DataFrame à partir de linhas

In [17]:
novoDataframe = alunosDf.loc[[0,1,2]]

In [18]:
novoDataframe.head()

     Nome  Nota Aprovado
0  Victor   4.0      Não
1    Luan   7.0      Sim
2    Guga   5.5      Não

In [19]:
novoDataframe02 = alunosDf.loc[alunosDf['Nota']!= 4]

In [20]:
novoDataframe02.head()

    Nome  Nota Aprovado
1   Luan   7.0      Sim
2   Guga   5.5      Não
3  Rever   9.0      Sim

## Mudar nome das colunas

In [29]:
obj_teste = {'coluna01':[1,2,3,4,5,'gold','gold'],
             'coluna02':[6,7,8,9,10,'silver','silver'],
             'coluna03':[11,12,13,14,15,'white','white']
            }
data_set_teste02 = pd.DataFrame(data = obj_teste)

In [30]:
data_set_teste02.head()

  coluna01 coluna02 coluna03
0        1        6       11
1        2        7       12
2        3        8       13
3        4        9       14
4        5       10       15

In [31]:
data_set_teste02.rename(columns={'coluna01':'numeros', 'coluna02':'segundo numero','coluna03':'troquei'}, inplace = True)

## Contar quantos valores aparecem

In [32]:
data_set_teste02['numeros'].value_counts()

gold    2
5       1
4       1
3       1
2       1
1       1
Name: numeros, dtype: int64

## Excluindo Colunas

In [33]:
data_set_teste02.head()

  numeros segundo numero troquei
0       1              6      11
1       2              7      12
2       3              8      13
3       4              9      14
4       5             10      15

In [34]:
data_set_teste02.drop('numeros', axis=1, inplace=True)
data_set_teste02.head()

  segundo numero troquei
0              6      11
1              7      12
2              8      13
3              9      14
4             10      15